{"posts":[{"id":"3753278c-85ec-407e-9efa-8026ab9535b8","title":"Maguire 'absolutely gutted' to miss Euros with injury","date":"2024-06-07","image":"https://ichef.bbci.co.uk/news/976/cpsprodpb/baa8/live/3d2d2030-2417-11ef-9aef-353badeede73.jpg.webp","description":"Manchester United defender Harry Maguire says he is \"absolutely gutted\" that he will have to miss Euro 2024 through injury.\n\nThe 31-year-old and Manchester City forward Jack Grealish, both regulars in Gareth Southgate's England squad, have not made the final 26-man list.\n\nThe central defender Maguire has not recovered sufficiently from a calf injury he sustained in April which kept him out of United’s FA Cup final victory over Manchester City last month.\n\nIn a post on social media,, external Maguire, who has represented the Three Lions on 63 occasions, confirmed he would not be playing in Germany.\n\nHe said: \"I'm devastated not to have been selected to play for England at the Euros this summer. Despite my best efforts, I've not been able to overcome an injury to my calf. Maybe I pushed myself too hard, to try and make it. Simply, I am absolutely gutted.\"\n\nBurnley goalkeeper James Trafford, Everton defender Jarrad Branthwaite, Liverpool's Jarell Quansah and Curtis Jones and Tottenham midfielder James Maddison have all also missed out."},{"id":"abca75b7-e97c-45d4-9785-2a74e0584a43","title":"Premier League clubs vote in favour of keeping VAR","date":"2024-06-07","image":"https://ichef.bbci.co.uk/news/976/cpsprodpb/a3dc/live/7f2bc9e0-2404-11ef-b479-218cd9628f98.jpg.webp","description":"Premier League clubs have voted by 19-1 in favour of keeping video assistant referees (VAR) next season.\n\nWolves triggered a vote on the use of VAR in the 2024-25 season after formally submitting a resolution to the Premier League in May.\n\nIn order for VAR to be scrapped, 14 of the 20 Premier League clubs needed to vote in favour of doing so.\n\nBut only Wolves voted in favour of the proposal as they failed to gain any support from other top flight clubs.\n\nWolves said they were \"disappointed with the outcome of the vote\" but welcomed the Premier League's \"commitment to improve VAR\".\n\nThe Premier League has come under increasing pressure to modify VAR, which was introduced at the start of the 2019-20 season.\n\nWolves listed nine reasons to support its proposal to ban VAR, including the impact on goal celebrations, hostility towards match officials and the length of time needed to reach decisions.\n\nIt was reaffirmed at the meeting that semi-automated offsides will be introduced at some point in the autumn, while the Premier League confirmed in-game VAR announcements will be put in place.\n\nThe in-game announcements, which were used during the 2023 women's World Cup, will see referees explain post-VAR decisions to supporters in stadiums.\n\nIn addition, the Premier League said the \"high threshold\" bar for VAR officials to intervene over subjective on-field decisions would be maintained.\n\nMalcolm Clarke, chairman of the Football Supporters' Association, said \"enormous changes\" were needed to the current system because fans \"cannot carry on like this.\"\nPremier League has work to do\n\nIt is no surprise Wolves' proposal to get rid of VAR was rejected.\n\nGiven the Premier League was committed to paying for it, whether they used it or not, any likelihood of clubs joining Wolves was non-existent.\n\nHowever, Wolves' secondary aim was to generate a wider debate and they have achieved that aim.\n\nNo-one, whether it is clubs, match officials or the Premier League, is happy with what is happening at the moment.\n\nThe Premier League wants greater transparency, which referees' chief Howard Webb believes will lead to greater understanding of the decision-making process.\n\nClubs - and players - want better decisions more quickly.\n\nThe introduction of semi-automated offsides from next autumn should help achieve that.\n\nLeague officials are stressing the technology, which has been tested and analysed during the current campaign, will not eliminate delays - but it should provide quicker decisions, particularly on the marginal calls, which seem to take forever at the moment.\n\nThe average reduction, it is being claimed, will be 31 seconds.\n\nBut there is still work to do. The Premier League needs to avoid finding itself in this position again, otherwise the vote might not be so clear-cut."},{"id":"636daa3f-ab42-46da-8d64-546f0ee90c3e","title":"WW2 veteran aged 102 dies on way to D-Day event ","date":"2024-06-07","image":"https://ichef.bbci.co.uk/news/800/cpsprodpb/2ca2/live/bfde8c40-23e9-11ef-981e-11de2ed01c29.jpg.webp","description":"A World War Two US Navy veteran travelling to France for an event marking the 80th anniversary of the D-Day landings has died, a veteran organisation has confirmed.\n\nRobert \"Al\" Persichitti from Rochester, New York, was airlifted to a hospital in Germany on 30 May after suffering a medical emergency aboard a ship heading to Europe.\n\nHe died the following day, aged 102.\n\nRemembered as a \"great, humble man,\" Mr Persichitti was involved in the allied operation in Japan.\n\nHonor Flight - a veteran organisation Mr Persichitti belonged to - confirmed his death on social media and said he had \"served his country bravely without hesitation\".\n\nThe non-profit helps transport former US servicemen to the memorials of the respective wars they fought in.\n\nThe 102-year-old was selected to attend the event in Normandy by the National World War Two Museum in New Orleans, which paid for and organised the trip, a local affiliate of CBS News, the BBC's US partner, reported.\n\n\"I'm really excited to be going\", he told broadcaster WROC-TV a day before he set off.\n\nHis cardiologist had encouraged him to travel, he added.\n\nAl DeCarlo, who served alongside Mr Persichitti in Japan, was also on the trip. He told local media in Rochester that his friend did not die alone.\n\n\"The doctor was with him... he was at peace and he was comfortable,\" he said, according to ABC news agency affiliate, WHAM-TV.\n\n\"She put his favourite singer, Frank Sinatra, on her phone and he peacefully left us.\"\n\nThe pair served in Iwo Jima together, a Japanese island the US captured from the country's imperial army in 1945.\n\nMr Persichitti's friend of 46 years, Pastor William Leone, told WHAM-TV \"he had a real zest for living\" and would visit children in local schools to talk to about his experiences.\n\nThe veteran was also a former teacher. In April, students at a local school helped organise a birthday celebration in his honour.\n\nIn 2020, he was named an honouree of New York State Senate's Veteran Hall of Fame by the then Senator Rich Funke.\n\nHis local chapter of Honor Flight in Rochester said they will miss him."},{"id":"f188d9d9-fae3-40a0-acfe-92a6a996e662","title":"Mbappe signs Real Madrid deal","date":"2024-06-04","image":"https://ichef.bbci.co.uk/news/800/cpsprodpb/6e32/live/11b73bd0-20e7-11ef-a3ab-e73c00cc3104.jpg.webp","description":"Kylian Mbappe has signed a contract to join Real Madrid on a free transfer when his Paris St-Germain deal expires on 30 June.\n\nThe France striker verbally agreed to move to the Bernabeu in February and then announced in May he would leave PSG at the end of the season.\n\nMbappe, 25, has now signed terms with Real Madrid and will move to Spain when the La Liga transfer window opens on 1 July.\n\nMadrid are expected to announce the deal next week and could formally present the forward at the Bernabeu before Euro 2024.\n\nMbappe, a World Cup winner in 2018, is PSG's record goalscorer with 256 goals since he joined them from Monaco on an initial loan in 2017."},{"id":"ffb990b2-3f0b-4383-9c8b-d9eac2634a7e","title":"Premier League charges 'frustrating', says Al-Mubarak","date":"2024-06-06","image":"https://ichef.bbci.co.uk/news/624/cpsprodpb/48e8/live/29330d10-231d-11ef-b04e-375672a6fc86.jpg.webp","description":"Manchester City chairman Khaldoon al-Mubarak says he is \"frustrated\" at the club’s on-pitch achievements being accompanied by repeated reminders of the 115 Premier League charges lodged against them.\n\nLast month City became the first club in English football history to win the league title in four consecutive seasons.\n\nBut in autumn a Premier League disciplinary commission is set to hear the case against City for allegedly breaching its financial regulations, some of which date back to 2009.\n\nCity deny all the charges – but recently manager Pep Guardiola admitted \"he did not know\" if people liked his team.\n\n“Of course, it’s frustrating,” Khaldoon told City’s internal media in his annual end of season address. “The referencing is always frustrating.\n\n“I feel for our fanbase and everyone associated with the club to have these charges constantly referenced.\n\n“It’s taking longer than anyone hoped for but there is a process we have to go through. I’ve always repeated, let’s be judged by the facts and not by claims and counterclaims.”"}]}